Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The value of each array element can either be an array, a string or anything else.
es: El valor de cada elemento de la tabla puede ser una tabla, una cadena o cualquier otra cosa.

source: If it is an array each attribute value is constructed by the key of each element plus a colon and the value of each element.
es: Si es una tabla, cada valor de atributo se construye como la clave de cada elemento más dos puntos y el valor de cada elemento.

source: If it is a string it is taken as the attribute value.
es: Si es una cadena se toma como valor del atributo.

source: An empty string will result in a complete removal of that attribute.
es: Una cadena vacía producirá la supresión completa del atributo.

source: If the value is neither a string nor an array but something else, e.g. an integer, no operation at all will be performed on the attribute.
es: Si el valor no es ni cadena ni tabla, sino otra cosa, p. ej. un entero, no se realizará operación alguna en el atributo.

source: This is neccessary if you want to to add a completely new attribute not just a new value for an existing attribute.
es: Esto es necesario se desea añadir un atributo completamente nuevo, no solamente un nuevo valor para un atributo existente.

source: If the remove array contained an empty string for that attribute, the attribute would be tried to be removed which would fail since it doesn 't exist.
es: Si la tabla eliminar contuviera una cadena vacía para dicho atributo, este se intentaría suprimir, lo que fallaría porque este no existe.

source: The following addition of a new value for that attribute would also fail.
es: La siguiente adición de un nuevo valor para dicho atributo también fallará.

source: 0 would not even try to remove it and the addition will work.
es: Fijando el valor para dicho atributo p. ej. a 0 hará que ni siquiera se intente eliminar, pero funcionará la adición del mismo.

source: If you would like to change the attribute 'Name' with the current value'books' into'articles' you will have to create two arrays and call hw_modifyobject().
es: Si desea cambiar el atributo 'Nombre' con el valor actual 'libros 'por el de 'artículos' deberá crear dos tablas y llamar a hw_modifyobject().

source: Example 1. modifying an attribute
es: Ejemplo 1. modificando un atributo

source: / / $connect is an existing connection to the Hyperwave server / / $objid is the ID of the object to modify $remarr = array( "Name "= "books"); $addarr = array("Name" = "articles"); $hw_modifyobject($connect, $objid, $remarr, $addarr);
es: / / $conexion es una conexión con el servidor Hyperwave / / $idobj es la ID del objeto a modificar $tablasupr = array( "Nombre "= "libros"); $tablaanad = array("Nombre" = "artículos"); $hw_modifyobject($conexion, $idobj, $tablasupr, $tablaanad);

source: Example 2. adding a completely new attribute
es: Ejemplo 2. añadiendo un atributo completamente nuevo

source: / / $connect is an existing connection to the Hyperwave server / / $objid is the ID of the object to modify $remarr = array( "Name "= 0); $addarr = array("Name" = "articles"); $hw_modifyobject($connect, $objid, $remarr, $addarr);
es: / / $conexion es una conexión con el servidor Hyperwave / / $idobj es la ID del objeto a modificar $tablasupr = array( "Nombre "= 0); $tablaanad = array("Nombre" = "artículos"); $hw_modifyobject($conexion, $idobj, $tablasupr, $tablaanad);

source: Multilingual attributes, e.g. 'Title', can be modified in two ways.
es: Los atributos plurilingües, p. ej. 'Título', se pueden modificar de dos maneras.

source: Either by providing the attributes value in its native form 'language' :'title' or by providing an array with elements for each language as described above.
es: O bien proporcionando los valores de los atributos en su forma nativa 'lenguaje' :'título', bien proporcionando una tabla con los elementos para cada lenguaje según se describe más arriba.

source: The above example would than be:
es: El ejemplo anterior podría quedar entonces:

source: Example 3. modifying Title attribute
es: Ejemplo 3. modificando el atributo Título

source: $remarr = array( "Title "= "en:Books"); $addarr = array("Title" = "en:Articles"); $hw_modifyobject($connect, $objid, $remarr, $addarr);
es: $tablasupr = array( "Título "= "es:Libros"); $tablaanad = array("Título" = "es:Artículos"); $hw_modifyobject($conexion, $idobj, $tablasupr, $tablaanad);

source: Example 4. modifying Title attribute
es: Ejemplo 4. modificando el atributo Título

source: $remarr = array( "Title "= array("en" = "Books")); $addarr = array("Title "= array("en" = "Articles", "ge"= "Artikel")); $hw_modifyobject($connect, $objid, $remarr, $addarr);
es: $tablasupr = array( "Título "= array("es" = "Libros")); $tablaanad = array("Título "= array("es" = "Artículos", "ge"= "Artikel")); $hw_modifyobject($conexion, $idobj, $tablasupr, $tablaanad);

source: Example 5. removing attribute
es: Ejemplo 5. eliminando atributos

source: $remarr = array( "Title "= ""); $addarr = array("Title" = "en:Articles"); $hw_modifyobject($connect, $objid, $remarr, $addarr);
es: $tablasupr = array( "Título "= ""); $tablaanad = array("Tñitulo" = "es:Artículos"); $hw_modifyobject($conexion, $idobj, $tablasupr, $tablaanad);

source: This will remove all attributes with the name 'Title' and adds a new'Title 'attribute.
es: Esto eliminará todos los atributos con el nombre 'Título' y añadirá un nuevo atributo 'Título '.

source: This comes in handy if you want to remove attributes recursively.
es: Esto es útil cuando se desea eliminar atributos de forma recursiva.

source: If you need to delete all attributes with a certain name you will have to pass an empty string as the attribute value.
es: Si necesita eliminar todos los atributos con un cierto nombre tendrá que pasar una cadena vacía como el valor del atributo.

source: Only the attributes' Title', 'Description 'and'Keyword' will properly handle the language prefix.
es: Sólo los atributos 'Title', 'Description' y 'Keyword '(así, en inglés) manejarán de forma apropiada el prefijo de idioma.

source: If those attributes don' t carry a language prefix, the prefix'xx 'will be assigned.
es: Si estos atributos no llevaran prefijo de idioma, se les asignariá el prefijo 'xx'.

source: The 'Name' attribute is somewhat special.
es: El atributo 'Name' es bastante especial.

source: In some cases it cannot be complete removed.
es: En algunos casos no puede ser completamente eliminado.

source: You will get an error message 'Change of base attribute' (not clear when this happens).
es: Obtendrá un mensaje de error 'Change of base attribute' ('Cambio de atributo base', no está muy claro cuando ocurre).

source: Therefore you will always have to add a new Name first and than remove the old one.
es: Por tanto, tendrá siempre que añadir un nuevo atributo Name primero y luego eliminar el anterior.

source: You may not suround this function by calls to hw_getandlock() and hw_unlock(). hw_modifyobject() does this internally.
es: No debe rodear esta función de llamadas a hw_getandlock() ni a hw_unlock(). hw_modifyobject() ya lo hace internamente.

source: Moves the objects with object ids as specified in the second parameter from the collection with id source id to the collection with the id destination id.
es: Mueve los objetos cuyas id se especifican en el segundo parámetro desde la colección con id id origen hasta la colección con el id id destino.

source: If the destination id is 0 the objects will be unlinked from the source collection.
es: Si el id de destino es 0, los objetos serán disociados de la colección origen.

source: If this is the last instance of that object it will be deleted.
es: Si esta fuese la última instancia del objeto, este sería borrado.

source: If you want to delete all instances at once, use hw_deleteobject().
es: Si desea borrar todas las instancias de una vez, utilice hw_deleteobject().

source: The value return is the number of moved objects.
es: El valor devuelto es el número de objetos movidos.

source: See also hw_cp(), and hw_deleteobject().
es: Vea también hw_cp(), hw_deleteobject().

source: Returns a new Hyperwave document with document data set to document_data and object record set to object_record.
es: Devuelve un nuevo documento Hyperwave en el que los datos del documento están fijados a datos_documento y el registro de objeto a registro_de_objeto.

source: The length of the document_data has to passed in document_size This function does not insert the document into the Hyperwave server.
es: Esta función no inserta el documento en el servidor Hyperwave.

source: See also hw_free_document(), hw_document_size(), hw_document_bodytag(), hw_output_document(), and hw_insertdocument().
es: Vea también hw_FreeDocument(), hw_DocumentSize(), hw_DocumentBodyTag(), hw_OutputDocument(), hw_InsertDocument().

source: The keys of the resulting array are the attributes names.
es: Convierte un registro_de_objeto en una tabla de objetos.

source: Multi-value attributes like 'Title' in different languages form its own array.
es: Las claves de la tabla resultante son los nombres de los atributos.

source: The keys of this array are the left part to the colon of the attribute value.
es: Los atributos múltiples como 'Título' en distintos idiomas forman su propia tabla.

source: Other multi-value attributes without a prefix form an indexed array.
es: Las claves de esta tabla son las partes a la izquierda de los dos puntos del valor del atributo.

source: If the optional parameter is missing the attributes' Title', 'Description 'and'Keyword' are treated as language attributes and the attributes'Group', 'Parent 'and'HtmlAttr' as non-prefixed multi-value attributes.
es: Actualmente, sólo los atributos 'Title', 'Description' y 'Keyword '(así, en inglés) son correctamente tratados.

source: By passing an array holding the type for each attribute you can alter this behaviour.
es: Otros atributos múltiples generan una tabla indizada.

source: The array is an associated array with the attribute name as its key and the value being one of HW_ATTR_LANG or HW_ATTR_NONE
es: Actualmente, sólo el atributo 'Group' es tratado correctamente.

source: See also hw_array2objrec().
es: Vea también hw_array2objrec().

source: Returns a connection index on success, or FALSE if the connection could not be made.
es: Devuelve un índice de conexión si hay éxito, o FALSE si la conexión no puede hacerse.

source: Opens a persistent connection to a Hyperwave server.
es: Abre una conexión permanente a un servidor Hyperwave.

source: You can have multiple persistent connections open at once.
es: Se pueden tener varias conexiones permanentes abiertas a la vez.

source: Returns the Hyperwave document with object ID objectID.
es: Devuelve el documento Hyperwave cuyo ID de objeto es IDobjeto.

source: If the document has anchors which can be inserted, they will have been inserted already.
es: Si el documento tiene enlaces que pueden ser insertados, deberán haberse insertado ya.

source: The document will be transfered via a special data connection which does not block the control connection.
es: El documento será transferido a través de una conexión de datos especial que no bloquea la conexión de control.

source: See also hw_gettext() for more on link insertion, hw_free_document(), hw_document_size(), hw_document_bodytag(), and hw_output_document().
es: Vea también hw_GetText() para saber más sobre inserción de enlaces, hw_FreeDocument(), hw_DocumentSize(), hw_DocumentBodyTag(), hw_OutputDocument().

source: Returns the object ID of the hyperroot collection.
es: Devuelve la ID de objeto de la colección hiper-raíz.

source: Currently this is always 0.
es: Actualmente siempre vale 0.

source: The child collection of the hyperroot is the root collection of the connected server.
es: La colección hija de la hiper-raíz es la colección raíz del servidor al que se ha conectado.

source: Unlocks a document, so other users regain access.
es: Desbloquea un documento para que otros usuarios puedan acceder al mismo de nuevo.

source: See also hw_getandlock().
es: Vea también hw_GetAndLock().

source: Returns an array of users currently logged into the Hyperwave server.
es: Devuelve una tabla de los usuarios actualmente conectados al servidor Hyperwave.

source: Each entry in this array is an array itself containing the elements id, name, system, onSinceDate, onSinceTime, TotalTime and self. 'self' is 1 if this entry belongs to the user who initianted the request.
es: Cada elemento de esta tabla contiene en sí mismo los elementos ID, nombre, sistema, onSinceDate (conectadoDesdeFecha), onSinceTime (conectadoDesdeHora), TotalTime (TiempoTotal) y self (propio). 'self 'es 1 si esta línea corresponde al usuario que realizó la petición.

source: PHP Manual
es: Manual de PHP

source: Up
es: Subir

source: Example 1. iconv_get_encoding() example:
es: Ejemplo 1. iconv_get_encoding() example:

source: Example 1. iconv() example:
es: Ejemplo 1. iconv() example:

source: Example 1. iconv_set_encoding() example:
es: Ejemplo 1. iconv_set_encoding() example:

source: result_id is a valid result id returned by ifx_query() or ifx_prepare().
es: result_id es un identificador válido del resultado de ifx_query() o ifx_prepare().

source: Returns the number of rows affected by a query associated with result_id.
es: Devuelve el número de filas procesadas por una consulta representada por un result_id (identificador de resultado).

source: For selects it is an estimate (sqlerrd[0]).
es: Para inserciones, actualizaciones y borrados el número es exactamente los registros procesados (sqlerrd[2]).

source: The database server can never return the actual number of rows that will be returned by a SELECT because it has not even begun fetching them at this stage (just after the "PREPARE "when the optimizer has determined the query plan).
es: No confíes en él.

source: Useful after ifx_prepare() to limit queries to reasonable result sets.
es: Es útil llamarla después de ejecutar ifx_prepare() pues así podemos limitar las consultas a número razonable de registros.

source: See also: ifx_num_rows()
es: Examina también: ifx_num_rows()

source: Informix affected rows
es: Número de registros procesados por una consulta

source: $rid = ifx_prepare ("select * from emp where name like ". $name, $connid); if (! $rid) {... error...} $rowcount = ifx_affected_rows ($rid); if ($rowcount 1000) {printf ("Too many rows in result set (%d)\n br", $rowcount); die ("Please restrict your query br \n");}
es: $rid = ifx_prepare ("select * from emp where name like ". $name, $connid); if (! $rid) {... error...} $rowcount = ifx_affected_rows ($rid); if ($rowcount 1000) {printf ("Too many rows in result set (%d)\n br", $rowcount); / / Demasiados registros en el resultado die ("Please restrict your query br \n"); / / Por favor, restringe tu consulta}

source: Informix functions
es: Funciones para Informix

source: Set the default blob mode for all select queries.
es: Define el modo por defecto para los blob en todas las consultas de selección.

source: Mode "0" means save Byte-Blobs in memory, and mode "1 "means save Byte-Blobs in a file.
es: El modo (mode) "0 "quiere decir que guarda en memoria los blobs de tipo BYTE y modo "1" significa guardarlos en un archivo.

source: Sets the default byte mode for all select-queries.
es: Define el modo por defecto para los campos de tipo byte en todas las consultas de selección.

source: Mode "0" will return a blob id, and mode "1 "will return a varchar with text content.
es: Modo (mode) "0 "devolverá un identificador de blob y "1" dará el contenido en un campo de tipo varchar.

source: Returns: always TRUE.
es: TRUE siempre.

source: ifx_close() closes the link to an Informix database that's associated with the specified link identifier.
es: ifx_close() cierra un enlace a una base de datos Informix que esté asociado con el identificador de enlace (link_identifier).

source: If the link identifier isn 't specified, the last opened link is assumed.
es: Si el identificador de enlace no es especificado, el último enlace abierto es asumido.

source: Note that this isn' t usually necessary, as non-persistent open links are automatically closed at the end of the script's execution.
es: Observa que esto no es necesario habitualmente ya que las conexiones no permanentes son cerradas automáticamente al finalizar el guión (script).

source: ifx_close() will not close persistent links generated by ifx_pconnect().
es: ifx_close() no cerrará enlaces persistentes generados por ifx_pconnect().

source: See also: ifx_connect(), and ifx_pconnect().
es: Examina también: ifx_connect(), y ifx_pconnect().

source: Closing a Informix connection
es: Cierre de una conexión a Informix

source: $conn_id = ifx_connect ("mydb@ol_srv", "itsme", "mypassword");... some queries and stuff... ifx_close($conn_id);
es: $conn_id = ifx_connect (mydb@ol_srv, "itsme", "mypassword");... algunas consultas y código... ifx_close($conn_id);

source: Returns a connection identifier on success, or FALSE on error.
es: Si tuvo éxito, devuelve un identificador de conexión en otro caso FALSE.

source: ifx_connect() establishes a connection to an Informix server.
es: ifx_connect() establece una conexión con un servidor INFORMIX.

source: All of the arguments are optional, and if they' re missing, defaults are taken from values supplied in configuration file (ifx.default_host for the host (Informix libraries will use INFORMIXSERVER environment value if not defined), ifx.default_user for user, ifx.default_password for the password (none if not defined).
es: Todos los argumentos son opcionales, y si no se pasan, se toman los valores del fichero de configuración (ifx.default_host para el ordenador donde se encuentra el servidor (si no es definida, las librerías de Infomix usarán la variable de entorno INFORMIXSERVER), ifx.default_user para el usuario (userid), ifx.default_password para la contraseña (password) (ninguna, si no es definida).

source: In case a second call is made to ifx_connect() with the same arguments, no new link will be established, but instead, the link identifier of the already opened link will be returned.
es: Para una segunda llamada a ifx_connect() con los mismos argumentos, no se establecerá una nueva conexión, en vez de eso, el identificador de enlace de la conexión abierta será devuelto.

source: The link to the server will be closed as soon as the execution of the script ends, unless it' s closed earlier by explicitly calling ifx_close().
es: La conexión con el servidor será cerrada tan pronto como la ejecución del guión (script) finalice, a menos que anteriormente se haya llamando a ifx_close().

source: See also ifx_pconnect(), and ifx_close().
es: Examina también ifx_pconnect(), y ifx_close().

source: Connect to a Informix database
es: Conexión a una base de datos Informix

source: $conn_id = ifx_connect ("mydb@ol_srv1", "imyself", "mypassword");
es: $conn_id = ifx_pconnect (mydb@ol_srv1, "imyself", "mypassword");

source: Duplicates the given blob object. bid is the ID of the blob object.
es: Duplica el objeto blob dado. bid es el identificador del objeto blob a copiar.

source: Returns FALSE on error otherwise the new blob object-id.
es: Devuelve FALSE si hubo error, en otro caso el identificador del nuevo objeto blob.

source: Creates an blob object.
es: Crea un objeto blob.

source: type:
es: type (tipo):

source: mode:
es: mode (modo):

source: 0 = blob-object holds the content in memory, 1 = blob-object holds the content in file.
es: 0 = el contenido del objeto blob es conservado en memoria, 1 = el contenido del objeto blob es mantenido en un archivo.

source: param: if mode = 0: pointer to the content, if mode = 1: pointer to the filestring.
es: param: si mode = 0: apunta al contenido en memoria, si mode = 1: contiene el nombre del fichero.

source: Return FALSE on error, otherwise the new blob object-id.
es: Devuelve FALSE si hubo error, en otro caso el identificador del nuevo objeto blob.

source: Creates an char object. param should be the char content.
es: Crea un objeto char. param será el contenido del char.

source: Executes a previously prepared query or opens a cursor for it.
es: Ejecuta una consulta preparada anteriormente o abre un cursor para ella.

source: Does NOT free result_id on error.
es: No libera result_id si hubo un error.

source: Also sets the real number of ifx_affected_rows() for non-select statements for retrieval by ifx_affected_rows()
es: También define el número real de registros procesados para consultas que no sean de selección y se puede obtener mediante ifx_affected_rows().

source: See also: ifx_prepare().
es: Examina también: ifx_prepare() (hay un ejemplo).

source: The Informix error codes (SQLSTATE SQLCODE) formatted as follows:
es: Los códigos de error de Informix (SQLSTATE SQLCODE) son representados como se especifica a continuación:

source: where x = space: no error
es: donde x = un espacio: no hubo error

source: E: error
es: E: hubo error

source: N: no more data
es: N: no hay más datos

source: W: warning
es: W: aviso

source: ?: undefined
es: ?: no definido

source: If the "x" character is anything other than space, SQLSTATE and SQLCODE describe the error in more detail.
es: Si el carácter "x" es cualquier otra cosa diferente a un espacio, SQLSTATE y SQLCODE describen el error con mayor detalle.

source: See the Informix manual for the description of SQLSTATE and SQLCODE
es: Examina el manual de Informix para el significado de SQLSTATE y SQLCODE.

source: Returns in a string one character describing the general results of a statement and both SQLSTATE and SQLCODE associated with the most recent SQL statement executed.
es: Devuelve en una cadena un caracter describiendo el resultado de una sentencia y los valores SQLSTATE y SQLCODE asociados con la última sentencia SQL ejecutada.

source: The format of the string is "(char) [SQLSTATE=(two digits) (three digits) SQLCODE=(one digit)]".
es: El formato de la cadena es "(char) [SQLSTATE=(dos dígitos) (tres dígitos) SQLCODE=(un dígitos)]".

source: The first character can be '' (space) (success), 'W' (the statement caused some warning), 'E' (an error happened when executing the statement) or 'N' (the statement didn't return any data).
es: El primer carácter puede ser '' (un espacio) (no hubo error), 'W' (la sentencia provocó un aviso), 'E' (la consulta produjo un error) o 'N' (la sentencia no devolvió ningún dato).

source: See also: ifx_errormsg()
es: Examina también: ifx_errormsg()

source: Returns the Informix error message associated with the most recent Informix error, or, when the optional "errorcode" param is present, the error message corresponding to "errorcode".
es: Si definismos el parámetro opcional "errorcode" (código de error), nos dará el mensaje de error correspondiente a ese código.

source: See also: ifx_error()
es: Examina también: ifx_error()

# printf( "%s lt;br ", ifx_errormsg(-201));
source: printf( "%s\n lt;br ", ifx_errormsg(-201));
es: printf( "%s\n br ", ifx_errormsg(-201));

source: Returns an associative array that corresponds to the fetched row, or FALSE if there are no more rows.
es: Devuelve un array (vector) correspondiente a la fila leída o FALSE si no hay más registros.

source: Blob columns are returned as integer blob id values for use in ifx_get_blob() unless you have used ifx_textasvarchar(1) or ifx_byteasvarchar(1), in which case blobs are returned as string values.
es: Las columnas blob son devueltas como identificadores de blob enteros (integer) para usarlos con ifx_get_blob() a menos que hayas usado ifx_textasvarchar(1) o ifx_byteasvarchar(1), en cuyo caso los blobs son devueltos como cadenas de texto.

source: Returns FALSE on error
es: Devuelve FALSE si hubo error.
